{
  "backend/main.mo": "Main Motoko actor defining types (Transaction, Customer, Notification, UserProfile), persistent state maps, authorization via MixinAuthorization/AccessControl, and all backend query/update functions for a chicken shop management system including customer portal, kg rate management, and notifications.",
  "feature_evidence.json": "Feature evidence report mapping two PDF export features (receipt PDF in TransactionList/ReceiptView and report PDF in AdminDashboard) to their relevant source files, components, and test requirement IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the frontend codebase's components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, chart palette, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the React app titled 'Smart Chicken Shop' with a root div and module script entry point at /src/main.tsx.",
  "frontend/src/App.tsx": "Root React component handling public customer portal routing, Internet Identity authentication, role-based navigation sidebar (admin/staff), profile setup modal, and access-denied screen for unauthorized users.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Simple full-screen access denied UI component displaying a shield icon, a configurable message, and a logout button that clears identity and React Query cache.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component with period-filtered metric cards (sales, payments, balance, customers), pending balance summary, and Export CSV and Export PDF buttons using csvExport and reportPdfExport utilities.",
  "frontend/src/components/AdminSettings.tsx": "Admin settings page component that allows viewing and updating the price-per-kg rate for chicken, with save/error/success feedback using React Query mutations.",
  "frontend/src/components/BalanceStatusBadge.tsx": "Small badge component that displays a customer's balance status as either 'CLEAR' (green) or 'PENDING' (amber), with optional amount display and configurable size.",
  "frontend/src/components/BarcodeInvoice.tsx": "Renders a decorative barcode-style SVG graphic deterministically generated from an invoice ID string, displayed above the invoice ID in monospace text.",
  "frontend/src/components/CustomerList.tsx": "Displays a searchable, filterable list of customers with options to add new customers, copy portal links, and delete customers (admin only), using React Query for data fetching.",
  "frontend/src/components/CustomerPortalView.tsx": "Customer-facing portal view that shows a customer's transactions and notifications, with a button to mark all notifications as read.",
  "frontend/src/components/CustomerProfile.tsx": "Detailed profile view for a single customer showing their info, balance, and a sorted transaction history with receipt links, fetched via React Query.",
  "frontend/src/components/CustomerRegistrationForm.tsx": "Form component for registering a new customer with name, phone, and address fields; on success displays the generated customer ID with a copy-to-clipboard option.",
  "frontend/src/components/EditTransactionModal.tsx": "A modal dialog for editing an existing transaction's weight, payment amount, and payment type, using the current kg rate for a live total preview and submitting via the editTransaction mutation.",
  "frontend/src/components/LoginPage.tsx": "A login page UI for the Smart Chicken Shop that authenticates staff and admins via Internet Identity, while noting customers require no login.",
  "frontend/src/components/MetricCard.tsx": "A reusable card component that displays a metric with a title, value, optional subtitle, icon, and color-coded styling for dashboard summaries.",
  "frontend/src/components/Navigation.tsx": "A responsive sidebar/mobile navigation component that renders role-filtered nav items, user info, and a logout button for admin, staff, and customer roles.",
  "frontend/src/components/NotificationBell.tsx": "A bell icon button with an unread count badge that opens a popover containing the NotificationList for a given customer.",
  "frontend/src/components/NotificationList.tsx": "Displays a scrollable list of in-app notifications for a customer with unread highlighting, timestamps, and a mark-all-read action.",
  "frontend/src/components/PaymentTypeSelector.tsx": "A labeled dropdown selector for choosing a payment type (cash, online, partial, fullClear) with descriptions, optionally triggering a callback on fullClear selection.",
  "frontend/src/components/PendingCustomersList.tsx": "Displays a list of customers with outstanding balances and provides buttons to send individual or bulk in-app payment reminders.",
  "frontend/src/components/PeriodSelector.tsx": "A small toggle UI component that lets users switch between daily, weekly, and monthly stat periods.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their name and saves their profile via the backend before they can proceed.",
  "frontend/src/components/ReceiptView.tsx": "Renders a detailed receipt for a specific transaction, including customer info, payment type, and barcode display, with options to download or print as PDF.",
  "frontend/src/components/TransactionForm.tsx": "A form for creating new transactions, supporting customer selection, weight/rate input, payment type, and balance calculation with auto-populated kg rate.",
  "frontend/src/components/TransactionList.tsx": "Displays a searchable, sortable table of all transactions with options to edit, delete (admin only), and download receipts as PDF.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state and persisting identity across page reloads using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including user profiles, customers, transactions, notifications, and stats, wrapping the ICP actor calls with caching and mutation support.",
  "frontend/src/index.css": "Global stylesheet that imports Inter font, sets up Tailwind CSS, and defines CSS custom properties for a green-and-white light/dark theme including sidebar, chart, and status colors.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the root DOM element.",
  "frontend/src/utils/calculations.ts": "Utility functions for computing transaction totals, balances, and formatting currency, weight, and timestamps for display.",
  "frontend/src/utils/csvExport.ts": "Exports a function that converts an array of transactions and customers into a CSV file and triggers a browser download.",
  "frontend/src/utils/pdfExport.ts": "Generates and downloads a styled thermal-receipt-style HTML/PDF for a single transaction, including a CSS-based barcode, customer details, and payment status.",
  "frontend/src/utils/reportPdfExport.ts": "Generates and downloads a period-filtered (daily/weekly/monthly) business report PDF containing transaction and customer balance tables with summary stats.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom color palette (including oklch CSS variables and shop-green scale), typography/container-queries/animate plugins, and custom shadows and keyframes.",
  "project_state.json": "Project state tracking file describing the Smart Chicken Shop App's architecture, existing implemented features, requirements, and versioning metadata for build planning."
}